{
  "tasks": [
    {
      "file_path": "Change_TV_channel/g1.txt",
      "task_name": "Change TV channel",
      "goal": "Turn on the TV by touching the remote control.",
      "guidance": "You can turn on the TV by touching the remote control. Do not switch on the TV directly.",
      "category": "arrangement"
    },
    {
      "file_path": "Clean_the_bathroom/g1.txt",
      "task_name": "Clean the bathroom",
      "goal": "Clean the bathroom sink directly.",
      "guidance": "You can clean the bathroom sink by scrubbing it, washing it, wiping it, or rinsing it.",
      "category": "cleaning"
    },
    {
      "file_path": "Clean_the_bathroom/g2.txt",
      "task_name": "Clean the bathroom",
      "goal": "Prepare a sink of soapy water in the bathroom.",
      "guidance": "You can prepare a sink of soapy water by putting soap in the sink, then turn on the faucet to fill the sink with water.",
      "category": "cleaning"
    },
    {
      "file_path": "Clean_the_bathroom/g3.txt",
      "task_name": "Clean the bathroom",
      "goal": "Wipe the toilet with toilet paper. Then throw it into the toilet.",
      "guidance": "You can wipe the toilet by holding the toilet paper and wipe the toilet. After wiping, put the toilet paper into the toilet.",
      "category": "cleaning"
    },
    {
      "file_path": "Cook_some_food/g1.txt",
      "task_name": "Cook some food",
      "goal": "Boil vegetables with a pot on the stove.",
      "guidance": "Clean the vegetables first. Fill a pot with water. Put the pot on the stove. Turn on the stove. Put vegetables in the pot. Then the vegetables are boiled.",
      "category": "cooking"
    },
    {
      "file_path": "Cook_some_food/g10.txt",
      "task_name": "Cook some food",
      "goal": "Boil some noodles with chicken.",
      "guidance": "Put the chicken on the cutting board and cut it into pieces. Find a pot and fill it with water. Put the pot on the stove and turn on the stove. Put the chicken and noodles in the pot.",
      "category": "cooking"
    },
    {
      "file_path": "Cook_some_food/g2.txt",
      "task_name": "Cook some food",
      "goal": "slice some chicken",
      "guidance": "Hold a knife. Put the chicken on the cutting board, then cut the chicken.",
      "category": "cooking"
    },
    {
      "file_path": "Cook_some_food/g3.txt",
      "task_name": "Cook some food",
      "goal": "Boil some vegetables. Then cool them in a bowl.",
      "guidance": "Wash the vegetables. Fill a pot with water. Put the pot on the stove. Turn on the stove. Put the vegetables in the pot. Then turn off the stove. Put the vegetables in a bowl.",
      "category": "cooking"
    },
    {
      "file_path": "Cook_some_food/g4.txt",
      "task_name": "Cook some food",
      "goal": "Boil some vegetables with pot. Then store the whole pot in the fridge.",
      "guidance": "Wash vegetables. Fill a pot with water. Put the pot on the stove. Turn on the stove. Put the vegetables inside the pot. Then turn off the stove. Put the pot in the fridge.",
      "category": "cooking"
    },
    {
      "file_path": "Cook_some_food/g5.txt",
      "task_name": "Cook some food",
      "goal": "Make oil fried banana.",
      "guidance": "The banana is already peeled. To fried it, find a fryingpan, put it on the stove. Turn on the stove and add some oil. Put the banana in the fryingpan.",
      "category": "cooking"
    },
    {
      "file_path": "Cook_some_food/g6.txt",
      "task_name": "Cook some food",
      "goal": "Slice apple, kiwi, and banana. Then put them on a plate.",
      "guidance": "Apple should be cleaned before slicing. Kiwi and banana is already peeled. To cut fruit, you should put it on a cutting board. Then use a knife to slice it. After slicing, put them on a plate.",
      "category": "cooking"
    },
    {
      "file_path": "Cook_some_food/g7.txt",
      "task_name": "Cook some food",
      "goal": "Get a bowl of ice cream and add some jam on the top.",
      "guidance": "You can find a bowl and put the ice cream in it. Then put some jam on the top of the ice cream.",
      "category": "cooking"
    },
    {
      "file_path": "Cook_some_food/g8.txt",
      "task_name": "Cook some food",
      "goal": "Make a bowl of egg salad with boiled egg, lemon, and vegetables.",
      "guidance": "Boil an egg and cut it into pieces. To boil egg, find a pot and fill it with water. Then put the pot on a stove and turn on the stove. Put the egg in the pot. After boiling, put the egg on a cutting board and cut it into pieces. Then put the egg in a bowl. Then clean a lemon and cut it into pieces. Put the lemon in the bowl. Then wash vegetables and cut them into pieces. Put the vegetables in the bowl.",
      "category": "cooking"
    },
    {
      "file_path": "Cook_some_food/g9.txt",
      "task_name": "Cook some food",
      "goal": "Make some French fries.",
      "guidance": "Find a potato and cut it into pieces. Then find a frying pan and put it on the stove. Turn on the stove and add some oil. Put the potato pieces in the frying pan.",
      "category": "cooking"
    },
    {
      "file_path": "Drink/g1.txt",
      "task_name": "Drink",
      "goal": "Get a cup of water.",
      "guidance": "You can get a cup of water by grabbing a cup and getting close to a faucet. Then turn on the faucet to fill the cup with water.",
      "category": "cooking"
    },
    {
      "file_path": "Drink/g2.txt",
      "task_name": "Drink",
      "goal": "Get a cup of water and freeze it.",
      "guidance": "You can get a cup of water by grabbing a cup and getting close to a faucet. Then turn on the faucet to fill the cup with water. After that, put the cup in the fridge.",
      "category": "cooking"
    },
    {
      "file_path": "Drink/g3.txt",
      "task_name": "Drink",
      "goal": "Get a cup of water and add some sliced kiwi inside.",
      "guidance": "You can get a cup of water by grabbing a cup and getting close to a faucet. Then turn on the faucet to fill the cup with water. After that, cut a kiwi and put it inside the cup.",
      "category": "cooking"
    },
    {
      "file_path": "Drink/g4.txt",
      "task_name": "Drink",
      "goal": "Get a cup of milk and heat it by microwave.",
      "guidance": "You can put the milk inside a cup. Then put the cup inside the microwave and turn the microwave on to heat.",
      "category": "cooking"
    },
    {
      "file_path": "Drink/g5.txt",
      "task_name": "Drink",
      "goal": "Use pot to boil some water.",
      "guidance": "Fill the pot with water. Then put the pot on the stove and turn on the stove.",
      "category": "cooking"
    },
    {
      "file_path": "Drink/g6.txt",
      "task_name": "Drink",
      "goal": "Make a cup of lemon water with additional sugar.",
      "guidance": "Clean a lemon and cut it into pieces. To cut lemon, you can put the lemon on a cutting board, use knife to slice it. Then find a cup and fill it with water. Then put the lemon pieces in the cup. Put sugar to the cup.",
      "category": "cooking"
    },
    {
      "file_path": "Iron_clothes/g1.txt",
      "task_name": "Iron clothes",
      "goal": "Directly iron a pair of skirt.",
      "guidance": "Put the skirt on the ironing board. Turn on the iron. Then put the iron on the skirt, push and pull it on the skirt.",
      "category": "laundry"
    },
    {
      "file_path": "Iron_clothes/g2.txt",
      "task_name": "Iron clothes",
      "goal": "Hand wash a shirt and iron this shirt.",
      "guidance": "Put the shirt in a sink and hand wash it. Then put the shirt on the ironing board. Turn on the iron. Then put the iron on the shirt, push and pull the iron on the shirt.",
      "category": "laundry"
    },
    {
      "file_path": "Iron_clothes/g4.txt",
      "task_name": "Iron clothes",
      "goal": "Iron a shirt, and put it in on the bed.",
      "guidance": "Put the shirt on the ironing board. Turn on the iron. Then put the iron on the shirt, push and pull it on the shirt. Finally, place the shirt on the bed.",
      "category": "laundry"
    },
    {
      "file_path": "Iron_clothes/g5.txt",
      "task_name": "Iron clothes",
      "goal": "Iron the shirt and the skirt.",
      "guidance": "For each piece of clothing, place it on the ironing board. Turn on the iron, then put the iron on the clothing, push and pull the iron.",
      "category": "laundry"
    },
    {
      "file_path": "Iron_clothes/g6.txt",
      "task_name": "Iron clothes",
      "goal": "Iron the shirt and the skirt, and place them on the bed.",
      "guidance": "For each piece of clothing, place it on the ironing board. Turn on the iron, then put it the iron the clothing, push and pull the iron. Finally, place the clothing on the bed.",
      "category": "laundry"
    },
    {
      "file_path": "Listen_to_music/g1.txt",
      "task_name": "Listen to music",
      "goal": "Insert a CD and play music using the CD player.",
      "guidance": "You should first put the cd in the cd player. Then turn on the cd player.",
      "category": "arrangement"
    },
    {
      "file_path": "Listen_to_music/g2.txt",
      "task_name": "Listen to music",
      "goal": "Turn on the dvd player.",
      "guidance": "You need to first plugin the dvd player. Then turn on the dvd player.",
      "category": "arrangement"
    },
    {
      "file_path": "Make_coffee/g1.txt",
      "task_name": "Make coffee",
      "goal": "Make a cup of coffee using the coffee maker.",
      "guidance": "Put a suitably sized cup into the coffee machine and start it. The coffee machine is already filled with water and coffee beans. Simply place the cup and start the machine.",
      "category": "cooking"
    },
    {
      "file_path": "Make_coffee/g2.txt",
      "task_name": "Make coffee",
      "goal": "make a cup of coffee using the coffee maker, then add milk and sugar.",
      "guidance": "Put a suitably sized cup into the coffee machine and start it. The coffee machine is already filled with water and coffee beans. Simply place the cup and start the machine. After the coffee is ready, add milk and sugar into the cup.",
      "category": "cooking"
    },
    {
      "file_path": "Pet_cat/g1.txt",
      "task_name": "Pet cat",
      "goal": "Find my cat and touch it",
      "guidance": "Find the cat on the coach and touch it",
      "category": "arrangement"
    },
    {
      "file_path": "Pet_cat/g2.txt",
      "task_name": "Pet cat",
      "goal": "Slice some chicken and give it to my cat.",
      "guidance": "Cut some chicken, and put the chicken close to the cat.",
      "category": "cooking"
    },
    {
      "file_path": "Pet_cat/g3.txt",
      "task_name": "Pet cat",
      "goal": "Prepare a bowl of water and put the bowl on the table in home office. Then find my cat put it on the table.",
      "guidance": "To get water, you can hold a bowl and get close to a faucet. Then turn on the faucet to fill the bowl with water. Then put the bowl on the table in the home office. After that, find my cat and put it on the table in the home office.",
      "category": "arrangement"
    },
    {
      "file_path": "Pet_cat/g4.txt",
      "task_name": "Pet cat",
      "goal": "Wash my cat.",
      "guidance": "Find the cat on the coach. Take the cat to a faucet. Turn on the faucet. Wash the cat.",
      "category": "cleaning"
    },
    {
      "file_path": "Pet_cat/g5.txt",
      "task_name": "Pet cat",
      "goal": "Shower my cat in the sink. Use towel to dry my cat.",
      "guidance": "Find the cat on the coach. Put the cat in the sink and wash it. Then hold a towel and wipe the cat.",
      "category": "cleaning"
    },
    {
      "file_path": "Prepare_a_reading_space/g1.txt",
      "task_name": "Prepare a reading space",
      "goal": "Find the book and put it on the coffee table in home office.",
      "guidance": "Find the book on the bookshelf and put it on the coffee table in the home office.",
      "category": "arrangement"
    },
    {
      "file_path": "Prepare_a_reading_space/g2.txt",
      "task_name": "Prepare a reading space",
      "goal": "Find the book and put it on the table in home office. Then turn on the light in the home office.",
      "guidance": "Find the book on the bookshelf and put it on the table in the home office. Then turn on the light in the home office.",
      "category": "arrangement"
    },
    {
      "file_path": "Prepare_a_reading_space/g3.txt",
      "task_name": "Prepare a reading space",
      "goal": "Find a book and put it on the coffe table in home office. Then open the window in the home office.",
      "guidance": "Find the book on the bookshelf and put it on the table in the home office. Then open the window in the home office.",
      "category": "arrangement"
    },
    {
      "file_path": "Prepare_a_reading_space/g4.txt",
      "task_name": "Prepare a reading space",
      "goal": "Find the book and put it on the coffe table in home office. Then prepare a cup of hot milk, put it on the table.",
      "guidance": "Find the book on the bookshelf and put it on the coffe table in the home office. To prepare a cup of hot milk, find the milk in the fridge, put it in a cup, put the cup in the microwave. Turn on the microwave. Finally put the cup on the table in the home office.",
      "category": "arrangement"
    },
    {
      "file_path": "Prepare_a_reading_space/g5.txt",
      "task_name": "Prepare a reading space",
      "goal": "Find my spectacles and put it on the coffe table in home office. Then find the book and put it on the coffe table in home office.",
      "guidance": "Find the spectacles and put it on the coffe table in the home office. Find the book on the bookshelf and put it on the coffe table in the home office.",
      "category": "arrangement"
    },
    {
      "file_path": "Prepare_breakfast/g1.txt",
      "task_name": "Prepare breakfast",
      "goal": "Slice and toast bread.",
      "guidance": "Cut the bread and put it in the toaster. Turn on the toaster.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_breakfast/g2.txt",
      "task_name": "Prepare breakfast",
      "goal": "Scramble egg by the fryingpan.",
      "guidance": "Put the pan on the stove. Turn on the stove. Put oil in the pan. Put the egg in the pan.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_breakfast/g3.txt",
      "task_name": "Prepare breakfast",
      "goal": "Boil egg.",
      "guidance": "Fill the pot with water. Put the pot on the stove. Turn on the stove. Put the egg in the pot.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_breakfast/g4.txt",
      "task_name": "Prepare breakfast",
      "goal": "Make chicken pasta, put it in a plate.",
      "guidance": "To boil some pasta, fill a pot with water. Put the pot on the stove and turn on the stove. Then put the pasta into the pot. To cook chicken, put some oil in a fryingpan and put the fryingpan on the stove and turn on the stove. Then put the chicken into the fryingpan. Lastly, put the pasta and chicken in a plate.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_breakfast/g5.txt",
      "task_name": "Prepare breakfast",
      "goal": "Prepare a cup of hot milk with cereal inside.",
      "guidance": "Find a cup to put the milk in. Then add cereal into the cup. Then you can hot the milk in the microwave.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_dinner/g1.txt",
      "task_name": "Prepare dinner",
      "goal": "Boil some rice by pot.",
      "guidance": "Fill the pot with water. Put the rice into the pot. Put the pot on the stove and turn on the stove.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_dinner/g2.txt",
      "task_name": "Prepare dinner",
      "goal": "Roast chicken with onion in the oven.",
      "guidance": "Put the chicken and onion in the oven. Then turn on the oven.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_dinner/g3.txt",
      "task_name": "Prepare dinner",
      "goal": "Cook bacon with the frying pan.",
      "guidance": "Put oil in the pan. Put the pan on the stove and turn on the stove. Put the bacon in the frying pan.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_dinner/g4.txt",
      "task_name": "Prepare dinner",
      "goal": "Fried rice with egg.",
      "guidance": "Boil some rice by pot. To boil rice, fill a pot with water, put the pot on the stove and turn on the stove. Then put the rice into the pot. After boil the rice, put a frying pan on the stove and turn on the stove. Then put rice, egg, oil in a frying pan.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_dinner/g5.txt",
      "task_name": "Prepare dinner",
      "goal": "Fried a steak. Then cut it and put it on a plate.",
      "guidance": "To fry a steak, find a fryingpan, put it on the stove. Turn on the stove and add some oil. Put the steak in the fryingpan. To cut the steak, put it on a cutting board. Then use a knife to slice it. After slicing, put it on a plate.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_dinner/g6.txt",
      "task_name": "Prepare dinner",
      "goal": "Put pizza and hamburger on a plate. Then hot them in the microwave. Then put them on a table in dinning room.",
      "guidance": "Find a plate to put the pizza and hamburger on. Then put them in the microwave. Turn on the microwave. After that, put the plate on the table in the dinning room.",
      "category": "cooking"
    },
    {
      "file_path": "Prepare_dinner/g7.txt",
      "task_name": "Prepare dinner",
      "goal": "Cook a pot of fish soup.",
      "guidance": "Clean the fish by washing it in a sink. Then cut the fish into pieces. Find a pot and fill it with water. Then put the pot on a stove and turn on the stove. Put the fish in the pot.",
      "category": "cooking"
    },
    {
      "file_path": "Put_groceries_in_Fridge/g1.txt",
      "task_name": "Put groceries in Fridge",
      "goal": "Put milk, turkey, egg, fish and chicken on one of the table in dining room.",
      "guidance": "Put milk, turkey, egg, fish and chicken on one of the table in dining room.",
      "category": "arrangement"
    },
    {
      "file_path": "Put_groceries_in_Fridge/g2.txt",
      "task_name": "Put groceries in Fridge",
      "goal": "Wash the fish at first. Then put milk, turkey, eggs, fish and chicken on one of the table in dining room.",
      "guidance": "Wash the fish at first. To wash the fish, put the fish in a sink and wash it. Then put milk, turkey, eggs, fish and chicken on one of the table in dining room.",
      "category": "arrangement"
    },
    {
      "file_path": "Put_groceries_in_Fridge/g3.txt",
      "task_name": "Put groceries in Fridge",
      "goal": "Throw all the items in the fridge to the trashcan.",
      "guidance": "Open the fridge and throw all the items in the fridge to the trashcan.",
      "category": "arrangement"
    },
    {
      "file_path": "Put_groceries_in_Fridge/g4.txt",
      "task_name": "Put groceries in Fridge",
      "goal": "Cut the chicken into pieces, then put back to the fridge.",
      "guidance": "To cut the chicken, put the chicken on the cutting board and hold a knife to cut it. Then put the chicken back in the fridge.",
      "category": "arrangement"
    },
    {
      "file_path": "Put_groceries_in_Fridge/g5.txt",
      "task_name": "Put groceries in Fridge",
      "goal": "Put milk and egg on one of the table in dining room. Throw all the items in the fridge to the trashcan. Then put milk and eggs back in the fridge.",
      "guidance": "Put milk and egg on the table in dining room. Throw all the items in the fridge to the trashcan. Then put milk and eggs back in the fridge.",
      "category": "arrangement"
    },
    {
      "file_path": "Turn_on_light/g1.txt",
      "task_name": "Turn on light",
      "goal": "Turn on the lights in the bathroom.",
      "guidance": "Turn on the lights in the bathroom.",
      "category": "arrangement"
    },
    {
      "file_path": "Turn_on_light/g2.txt",
      "task_name": "Turn on light",
      "goal": "Turn on the lights in the bedroom. Then turn on the lights in the bathroom.",
      "guidance": "Turn on the lights in the bedroom. Then turn on the lights in the bathroom.",
      "category": "arrangement"
    },
    {
      "file_path": "Turn_on_light/g3.txt",
      "task_name": "Turn on light",
      "goal": "Make sure there is at least one light on in every room.",
      "guidance": "Make sure there is at least one light on in every room.",
      "category": "arrangement"
    },
    {
      "file_path": "Vacuum_the_living_room/g1.txt",
      "task_name": "Vacuum the floor",
      "goal": "Vacuum the floor by push and pull the vacuume clearner.",
      "guidance": "Turn on the vacuum cleaner. Hold the vacuum cleaner. Push and pull the vacuum cleaner.",
      "category": "cleaning"
    },
    {
      "file_path": "Wash_clothes/g1.txt",
      "task_name": "Wash clothes",
      "goal": "Wash all the clothes in the basket for clothes by washing machine.",
      "guidance": "The basket of clothes is next to the sink in the bathroom. Put all the clothes inside the basket for clothes into the washing machine. Turn on the washing machine.",
      "category": "laundry"
    },
    {
      "file_path": "Wash_clothes/g2.txt",
      "task_name": "Wash clothes",
      "goal": "Wash all the clothes in the basket for clothes by adding soap to the washing machine and running it.",
      "guidance": "The basket of clothes is next to the sink in the bathroom. Put all the clothes inside the basket for clothes into the washing machine. Put a soap into the washing machine. Turn on the washing machine.",
      "category": "laundry"
    },
    {
      "file_path": "Wash_clothes/g3.txt",
      "task_name": "Wash clothes",
      "goal": "Hand wash the jacket, then wash it by washing machine.",
      "guidance": "To hand wash the jacket, put the jacket in a sink and wash it. After that put it into the washing machine and turn on the washing machine.",
      "category": "laundry"
    },
    {
      "file_path": "Wash_clothes/g4.txt",
      "task_name": "Wash clothes",
      "goal": "First, hand wash the underwear with soap in the sink in the bathroom, then put it in the washing machine, add some detergent for a thorough clean.",
      "guidance": "Put the underwear in a sink in the bathroom. Hold a soap and wash the underwear by hand. Then put the underwear in the washing machine. Add detergent to the washing machine. Turn on the washing machine.",
      "category": "laundry"
    },
    {
      "file_path": "Wash_dishes_with_dishwasher/g1.txt",
      "task_name": "Wash dishes with dishwasher",
      "goal": "wash all the bowls and the plates with dishwasher",
      "guidance": "Put all the bowls and the plates into the dishwasher. Turn on the dishwasher.",
      "category": "cleaning"
    },
    {
      "file_path": "Wash_dishes_with_dishwasher/g2.txt",
      "task_name": "Wash dishes with dishwasher",
      "goal": "Put cleaning solution in the dishwasher. Then wash the bowls and the plates with dishwasher.",
      "guidance": "Put a cleaning solution in the dishwasher. Then put all the bowls and the plates into the dishwasher. Turn on the dishwasher.",
      "category": "cleaning"
    },
    {
      "file_path": "Wash_dishes_with_dishwasher/g3.txt",
      "task_name": "Wash dishes with dishwasher",
      "goal": "Wash the bowls and plates with dishwasher. And wash forks by hand.",
      "guidance": "Put all the bowls and plates into the dishwasher. Turn on the dishwasher. Wash the forks by hand.",
      "category": "cleaning"
    },
    {
      "file_path": "Wash_windows/g1.txt",
      "task_name": "Wash windows",
      "goal": "Open the windows in the bathroom.",
      "guidance": "Open the window in the bathroom.",
      "category": "cleaning"
    },
    {
      "file_path": "Wash_windows/g2.txt",
      "task_name": "Wash windows",
      "goal": "Wipe all the windows in the house by towel.",
      "guidance": "Hold a towel. And wipe all the windows in the house.",
      "category": "cleaning"
    },
    {
      "file_path": "Write_an_email/g1.txt",
      "task_name": "Write an email",
      "goal": "Turn on the computer in home office.",
      "guidance": "Get close to the computer in the home office, turn on the computer. Then type the keyboard close to this computer.",
      "category": "arrangement"
    }
  ],
  "summary": {
    "total_tasks": 70,
    "categories": {
      "arrangement": 19,
      "cleaning": 11,
      "cooking": 31,
      "laundry": 9
    }
  }
}