{
    "scene_1":{
        "417_1": {
            "bug":"all clothes except the jacket are in the washing_machine initially. Put them into another basket.",
            "task_name": "Wash clothes",
            "natural_language_description": "Walk to the kitchen and find the basket of clothes. Put the soap and clothes into the washing machine. Turn on the washing machine.",
            "goals":{
                "g1":"Find the basket of clothes in kitchen, wash them in the washing machine.",
                "g2":"Find the basket of clothes in kitchen, put the clothes into the washing machine with some soap, and wash them.",
                "g3":"Find the basket of clothes in kitchen. First, hand wash these clothes, then put it in the washing machine for a thorough clean.",
                "g4":"Find the basket of clothes in kitchen. First, hand wash these clothes with soap, then put clothes and soap in the washing machine for a thorough clean.",
                "g5":"Find the basket of clothes in kitchen. First, hand wash these clothes with soap, then put the clothes into the washing machine for a thorough clean. I want to use some cleaning products to make my clothes cleaner, but I don't want to use the laundry detergent."
            },
            "guidance":{
                "partial plan":{
                    "find basket of clothes":"I have two basket of clothes in the kitchen. One has a pant, two shirts and another has my jacket insde. I need the one with jacket inside.",
                    "use_washing_machine":"1. Make sure the washing machine is off.\n 2. Open the washing machine.\n 3. Put what you want to wash inside.\n 4. Close the washing machine.\n 5. Turn on the washing machine.\n 6. Turn off the washing machine after the clothes are washed.\n 7. Open the washing machine.\n 8. Take out the clothes.\n 9. Close the washing machine.",
                    "hand wash clothes":"1. Put the clothes in the sink.\n Turn on the faucet close to the sink.\n 3.wash/scrub/rinse the clothes.\n 4. Turn off the faucet.\n 5. Take out the clothes."
                }
            }
        },
        "850_1":{"bug":"all the clothes are in the washing_machine initially"},
        "954_2":{"bug":"same as 27_2"},
        "11_1":{
            "bug":"no tv controller in the living room initially",
            "task_name": "Turn on light",
            "natural_language_description": "I go to bedroom and locate a lamp. This lamp can be turned on by touch, as it has capacitive sensing. So I do it.",
            "goals":{
                "g1":"Turn on the lights in the bathroom.",
                "g2":"Turn on the lights in the bedroom. Then turn on the lights in the bathroom.",
                "g3":"Make sure there is at least one light on in every room.",
                "g4":"Turn on all the lights in the house. Except the lights in the home office.",
                "g5":"Turn on the lights around bed.",
                "g6":"Turn on the tv and turn off all the lights in the home office."
            },
            "guidance":{
                "partial plan":{
                    "lights in the bathroom":"ceilinglamp_26, walllamp_27, walllamp_28, walllamp_29, light_64",
                    "lights in the bedroom":"ceilinglamp_96, tablelamp_97, tablelamp_98, light_169",
                    "lights in the diningroom":"ceilinglamp_223, ceilinglamp_224, light_245",
                    "lights in home office":"ceilinglamp_349, walllamp_350, walllamp_351, light_411"                
                }
            }
        },
        "699_1":{
            "task_name": "Write an email",
            "natural_language_description": "Walk to the office, sit down on chair, attach keyboard to the computer, attach mouse to the computer, switch the computer on, type the email on the keyboard.",
            "goals":{
                "g1":"Go to the home office and turn on the computer.",
                "g2":"Go to the home office and turn on the computer. Sit on the chair in front of the computer. Touch the mouse and check my email.",
                "g3":"Go to the home office and turn on the computer. Sit on the chair in front of the computer. Touch the mouse and check my email. Then type a new email.",
                "g4":"Go to the home office and turn on the computer. Sit on the chair in front of the computer. Touch the mouse and check my email. Then type a new email. Finally, turn off my computer after sending the email.",
                "g5":"Work on the computer in the home office."
            },
            "guidance":{
                "partial plan":{
                    "find computer":"I have two computer in the home. I use the one in the home office for work.",
                    "check email":"1. Ensuring the computer is on.\n 2. Touching the mouse to operate the computer.",
                    "type email":"1. Sitting in front of the computer.\n 2.Ensuring the computer is on.\n 3. Touching the mouse to operate the computer.\n 4. Using the keyboard to type the email.",
                    "work":"1. Sitting in front of the computer.\n 2.Ensuring the computer is on.\n 3. Touching the mouse to operate the computer.\n 4. Using the keyboard to type the email."
                }
            }
        },
        "772_1":{
            "bug":"milk, eggs, fish and turkey are in the freezer initially. Move them to the kitchen counter. Has no knife inside the kitchen.",
            "task_name": "Put groceries in Fridge",
            "natural_language_description": "Walk to kitchen. Open fridge. Put milk in fridge. Put turkey in fridge. Put eggs in fridge. Put fish in fridge. Put chicken in fridge.",
            "goals":{
                "g1":"Put milk, turkey, eggs, fish and chicken in the freezer.",
                "g2":"Wash the fish at first. Then put milk, turkey, eggs, fish and chicken in the freezer.",
                "g3":"Throw away everything originally in the freezer. Then put milk, turkey, eggs, fish and chicken in the freezer.",
                "g4":"Cut the chicken into pieces, then put it in the freezer.",
                "g5":"Wash the fish at first. Then cut the chicken into pieces. Throw all the items originally in the freezer. Finally, put milk, turkey, eggs, washed fish and cut chicken in the freezer."
            },
            "guidance":{
                "partial plan":{
                    "wash food":"1. Put the food in the sink.\n 2. Turn on the faucet close to the sink.\n 3. Wash the food.\n 4. Turn off the faucet.\n 5. Take out the food.",
                    "cut food":"1. Put the food on the cutting board.\n 2. Use the knife to cut the food.\n 3. Qash the knife.\n 4. Take out the food.",
                    "put food in fridge":"1. Open the fridge.\n 2. Put the food in the fridge.\n 3. Close the fridge."
                }
            }
        },
        "188_1":{
            "task_name": "Change TV channel",
            "natural_language_description": "its time for my favorite show and im going change with the help of remote control and watch",
            "goals":{
                "g1":"Control the TV.",
                "g2":"Control the TV with the remote control.",
                "g3":"Sitting on the couch, then control the TV with the remote control.",
                "g4":"Turn on the TV by remote control",
                "g5":"Turn off the TV by remote control"
            },
            "guidance":{
                "partial plan":{
                   "control TV with remote control":"1. Grab the remote control.\n 2. Turn to the TV.\n 3. Push the remote control",
                   "turn on TV with remote control":"1. Grab the remote control.\n 2. Turn to the TV.\n 3. Push the remote control",
                   "turn off TV with remote control":"1. Grab the remote control.\n 2. Turn to the TV.\n 3. Push the remote control"
                }
            }
        },
        "826_1":{
            "task_name": "Wash dishes with dishwasher",
            "natural_language_description": "Put dishes in the dishwasher and start the dishwasher.",
            "goals":{
                "g1":"wash the bowls and the plates with dishwasher",
                "g2":"Put dish soap in the dishwasher. Wash the bowls and the plates with dishwasher",
                "g3":"wash drinking glasses, bowls and the plates and forks with dishwasher",
                "g4":"wash all the dishes on the table with dishwasher",
                "g5":"wash those cookware on the table, kitchen counter and stove."
            },
            "guidance":{
                "partial plan":{
                    "what can washing machine wash":"washing machine can only wash small items like bowls, plates, forks, spoons, drinking glasses, and cups.",
                    "Wash cookware by hand":"cookwares should be wash by hand. You can put them in the sink, turn on the faucet close to the sink, wash the cookware, turn off the faucet, and take out the cookware.",
                    "use dishwasher":"1. Make sure the dishwasher is off.\n 2. Open the dishwasher.\n 3. Put what you want to wash inside.\n 4. Close the dishwasher.\n 5. Turn on the dishwasher.\n 6. Turn off the dishwasher after the dishes are washed.\n 7. Open the dishwasher.\n 8. Take out the dishes.\n 9. Close the dishwasher."
                }
            }
        },
        "509_2":{
            "task_name":"make up bed",
            "natural_language_description":"Make the bed so that I can rest at any time.",
            "goals":{
                "g1":"Find two pillows and put them on the bed",
                "g2":"Store all the clothes on the bed to the closetdrawer. Then find the pillow and put it on the bed",
                "g3":"Store all the clothes on the bed to the closetdrawer. Then find the pillow and put it on the bed. And prepare a cup of water on the nightstand"
            },
            "guidance":{
                "partial plan":{
                    "get water":"1. Find a cup.\n 2. Put the water in the sink.\n 3. Turn on the faucet close to the sink to fill the cup.\n 4.Turn off the faucet.\n 5. Take out the cup.",
                    "store clothes":"There are closetdrawers in the bedroom."
                }
            }
        },
        "469_2":{
            "task_name": "Pet cat",
            "natural_language_description": "Walk into bedrrom and to the sofa. Sit on the sofa and touch cat.",
            "goals":{
                "g1":"Find my cat and touch it",
                "g2":"Slice some chicken to feed my cat.",
                "g3":"Prepare a bowl of water for my cat. Put the bowl on the table in home office. Then find my cat take it to the table.",
                "g4":"Shower my cat in the bathtub.",
                "g5":"Shower my cat in the bathtub. Use towel to dry my cat.",
                "g6":"Shower my cat in the bathtub. Use towel to dry my cat. Clean the towel in the sink.",
                "g7":"Shower my cat in the bathtub. Use towel to dry my cat. Clean the towel in the sink. Squeeze the towel to dry it."
            },
            "guidance":{
                "partial plan":{
                    "find cat":"my cat is usually on the couch",
                    "slice food":"1. Find a knife.\n 2. Find a cutting board.\n 3. Put the food on the cutting board.\n 4. Use the knife to cut the food.\n 5. Take out the food.",
                    "get water":"1. Find a container.\n 2. Put the container in the sink.\n 3. Turn on the faucet close to the sink to fill the container.\n 4.Turn off the faucet.\n 5. Take out the container.", 
                    "wash cat":"There is water in the bathtub already, so you can just put the cat in the bathtub and wash it.",
                    "dry by towel":"Grab a towel and wipe.",
                    "clean towel":"1. Put the towel in the sink.\n 2. Turn on the faucet close to the sink.\n 3. Wash the towel.\n 4. Turn off the faucet.\n 5. Take out the towel.",
                    "squeeze towel":"1. Get close to the sink.\n 2. Squeeze the towel."
                }
            }
        },
        "462_2":{
            "task_name": "Listen to music",
            "natural_language_description": "I walk to my bedroom.  I locate my stereo and turn it on.  I put on my headphones and sit to listen.",
            "goals":{
                "g1":"Turn on the cd player.",
                "g2":"Turn on the dvd player with remote control.",
                "g3":"Play music on phone and listen to it with headset.",
                "g4":"Play music on phone and listen to it with headset. Then turn off the phone."
            },
            "guidance":{
                "partial plan":{
                    "turn on cd player":"1. Find the cd player.\n 2. Turn on the cd player.",
                    "turn on dvd player":"1. Find the dvd player.\n 2. Turn on the dvd player.",
                    "play music on phone":"1. Find the phone.\n 2. Touch or type the phone.",
                    "listen to music with headset":"1. Find the headset.\n 2. Put on the headset."
                }
            }
        },
        "181_2":{
            "task_name": "Drink",
            "natural_language_description": "go to kitchen, find water glass and grab it, find fridge and open grab water and pour into it, then drink.",
            "goals":{
                "g1":"Get a cup of water from the faucet in the dining room.",
                "g2":"Get a cup of ice water from the freezer.",
                "g3":"Get a cup of water and add some sliced kiwi inside.",
                "g4":"Get a cup of water and heat it by microwave.",
                "g5":"Use pot to boil some water, and fill the cup with boiled water."
            },
            "guidance":{
                "partial plan":{
                    "get water":"1. Find a cup.\n 2. Put the cup in the sink.\n 3. Turn on the faucet close to the sink to fill the cup.\n 4.Turn off the faucet.\n 5. Take out the cup.",
                    "add fruit to water":"1. Find a knife.\n 2. Find a cutting board.\n 3. Put the fruit on the cutting board.\n 4. Use the knife to cut the fruit.\n 5. Take out the fruit.\n 6. Put the fruit in the cup of water.",
                    "heat water by microwave":"1. Find a cup with water.\n 2. Put the cup in the microwave.\n 3. Turn on the microwave.\n 4.Turn off the microwave.\n 5. Take out the cup.",
                    "boil water":"1. Find a pot.\n 2. Put the pot in the sink.\n 3. Turn on the faucet close to the sink to fill the pot with water.\n 4. Turn off the faucet.\n 5. Put the pot on the stove.\n 6. Turn on the stove.\n 7. Turn off the stove.\n 8. Take out the pot."
                }
            }
        },
        "16_2":{
            "bug":"the initial place of the book should be set to the bookshelf in the bedroom",
            "task_name": "Prepare a reading space",
            "natural_language_description": "I walk to the living room and pick up a book from the coffee table. I find my favorite chair.  I sit in the armchair and open the book.  I read.",
            "goals":{
                "g1":"Find the novel and put it on the coffe table in home office.",
                "g2":"Find the novel and put it on the coffe table in home office. Then turn on the light in the home office.",
                "g3":"Find the novel and put it on the coffe table in home office. Then open the window in the home office.",
                "g4":"Find the novel and put it on the coffe table in home office. Then prepare a cup of hot milk, put it on the table.",
                "g5":"Find my spectacles and put it on the coffe table in home office. Then find the novel and put it on the coffe table in home office. Then prepare a cup of hot milk, put it on the table."
            },
            "guidance":{
                "partial plan":{
                    "find novel":"The novel is on the bookshelf in the bedroom.",
                    "turn on light":"1. Find the light switch.\n 2. Turn on the light switch.",
                    "find milk":"The milk is in the freezer.",
                    "heat milk":"You can use microwave to heat the milk.",
                    "use microwave":"1. Open the microwave.\n 2. Put the milk in the microwave.\n 3. Close the microwave.\n 4. Turn on the microwave.\n 5. Turn off the microwave.\n 6. Open the microwave.\n 7. Take out the milk.\n 8. Close the microwave."
                }
            }
        },
        "1083_2":{
             "task_name": "Cook some food",
            "natural_language_description": "walk to kicthen , find stove , find cooking pot , find vegetables , find water  ,put vegetables in cooking pot, pour water to cooking pot,put cooking pot on stove, switch on stove",
            "goals":{
                "g1":"Put vegetables in a pot and boil them on the stove.",
                "g2":"Wash all the vegetables, then put them in a pot and boil them on the stove.",
                "g3":"Wash all the vegetables, then put them in a pot and boil them on the stove. Then cool them in a bowl of water.",
                "g4":"Wash all the vegetables, then put them in a pot and boil them on the stove. Then store them in the freezer."
            },
            "guidance":{
                "partial plan":{
                    "boil food":"1. Find a pot.\n 2. Put the pot in a sink.\n 3. Turn on the faucet close to the sink to fill the pot with water.\n 4. Turn off the faucet.\n 5. Put the pot on the stove.\n 6. Turn on the stove.\n 7. Put the food into the pot.\n 8. Turn off the stove.",
                    "wash food":"1. Put the food in the sink.\n 2. Turn on the faucet close to the sink.\n 3. Wash the food.\n 4. Turn off the faucet.\n 5. Take out the food."
                }
            }
        },
        "229_1":{
            "task_name": "Make coffee",
            "natural_language_description": "Open coffee maker. Put filter in main basket, put ground coffee in filter, fill reservoir with water, turn on coffee maker."
        }
        

    }
}